{"reviews": {"91339130": {"recommendationid": "91339130", "author": {"steamid": "76561198006321973", "num_games_owned": 35, "num_reviews": 4, "playtime_forever": 740, "playtime_last_two_weeks": 740, "playtime_at_review": 740, "last_played": 1620033606}, "language": "english", "review": "If you're an R-Type fan or shmup fan this is a must have.  It's basically exceeded my expectations in almost every way and I just can't put it down.  It's not a game for the faint of heart or for those easily frustrated.  This game will tear you apart but it's so rewarding to find a path forward and to find solutions as it's a shmup but each screen almost plays more like a puzzle that can only be passed with the tools available to you.\n\nI haven't played a shmup in years and it took me about 12 hours to beat the game finally on normal and there's 2 difficulties and a few unplayed branching stages I have yet to find.  I'm going to get well more than my 40 dollars worth.\n\nThe soundtrack and most of the graphics are great, the level and enemy placement is designed tight and with a lot of thought and care.  The game runs great on my pc and I really don't have a lot of complaints.\n\nThere's a few bugs Granzella has acknowledged and a stage or two where the graphics are a bit lacking compared to others.  There's a few muddy textures here and there but these are small complaints.\n\nBuy it.  If you're even here you're probably interested and know what you're getting into.  R-Type is back and it's fantastic.  Helluva job Granzella!", "timestamp_created": 1620027342, "timestamp_updated": 1620027342, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91332097": {"recommendationid": "91332097", "author": {"steamid": "76561197973172334", "num_games_owned": 423, "num_reviews": 136, "playtime_forever": 618, "playtime_last_two_weeks": 618, "playtime_at_review": 440, "last_played": 1620026144}, "language": "english", "review": "MASTERPIECE.\n\nI skipped Final so can't compare the two but when comparing this to Delta the gameplay is just as exciting.  Love the level design, boss design, and enemy layout.  Some truly tricky sections and tough enemy bottlenecks really make you want to improve.  Feels really good once you finally figure out how to ace those tougher sections.   Love the music and graphical effects along with the multitude of ship choices and weapons.  It's truly beautiful and runs perfectly smooth @ 1440p and 144fps.  Honestly I wasn't excepting this game to be so good after reading so many  complaints.  Have to say those complaints are wrong IMO (except for those having performance issues) Don't know what else to say about the game except F2 is now a go to favorite of mine.", "timestamp_created": 1620014227, "timestamp_updated": 1620014344, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91331972": {"recommendationid": "91331972", "author": {"steamid": "76561198001816322", "num_games_owned": 735, "num_reviews": 31, "playtime_forever": 324, "playtime_last_two_weeks": 324, "playtime_at_review": 324, "last_played": 1620013011}, "language": "english", "review": "Some of the best gameplay of the series but the atmosphere and spectacle are not quite up to the very high standard of the classic games.", "timestamp_created": 1620014034, "timestamp_updated": 1620014034, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "91320219": {"recommendationid": "91320219", "author": {"steamid": "76561197970626567", "num_games_owned": 1048, "num_reviews": 21, "playtime_forever": 49, "playtime_last_two_weeks": 49, "playtime_at_review": 49, "last_played": 1619958784}, "language": "english", "review": "I have been a big fan of R-Type games and the Shootemup genre for over 3 decades. This latest game is very good, it plays smooth and its very responsive. The only thing I am disappointed with is the screen modes and resolutions available. \nI am running the game in 2560x1440 and fills my Ultra Wide Screen. Message to the Devs, please add proper 21:9 Ultra Wide Screen resolutions like 3440x1440 & 3840x1600, and I'm sure there are some Super Ultra Wide Screen monitor uses that would appreciate some modes for their monitors. I would love to be able to play R-Type Final 2 in 3840x1600.", "timestamp_created": 1619994678, "timestamp_updated": 1619994678, "voted_up": true, "votes_up": 2, "votes_funny": 1, "weighted_vote_score": "0.511705696582794189", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91315997": {"recommendationid": "91315997", "author": {"steamid": "76561198156231391", "num_games_owned": 457, "num_reviews": 50, "playtime_forever": 171, "playtime_last_two_weeks": 197, "playtime_at_review": 171, "last_played": 1619827559}, "language": "english", "review": "It's good, please play it.", "timestamp_created": 1619988979, "timestamp_updated": 1619988979, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.471014469861984253", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91310656": {"recommendationid": "91310656", "author": {"steamid": "76561198046354051", "num_games_owned": 751, "num_reviews": 19, "playtime_forever": 114, "playtime_last_two_weeks": 114, "playtime_at_review": 114, "last_played": 1619976911}, "language": "english", "review": "This review will be updated in time as the game is updated. I want to recommend this game, as I have been a fan of R-Type since the first few games over 30 years ago now. But right now the game has issues, issues that can hopefully be fixed! \n\nRight now the game is buggy, has lag issues during key moments of fights, and has menu glitches that make it impossible to interact with the game if you alt tab out and tab back in. Currently, I have not gotten to any of the final paths of the game (It has branching paths beginning with level 6 depending on a choice you make at the end of level 5, similar to the first Final). However, the reason for this has not been because the game is too hard or I'm bad at it or any complaints with the levels themselves. When I reached level 5 the first time, I died to the final boss on it, alt-tabbed out to check a discord message, and when I came back the game wouldn't do anything. I could not hit continue, I could not select a fighter, nothing. Controller and keyboard become completely unresponsive, no matter what button I pushed I just got nothing or an error sound from the game. \n\nSo I quit it, and retried. Same thing happened when I alt-tabbed again. The menus are also buggy when looking through the bydo labs and the other gallery sections, not properly responding to directional inputs, leaving your input in a spot it wasn't upon exiting out of a menu, etc. \n\nJust now I played again, got through stage 6.2, and the game crashed for the third time today trying to load stage 7.2. \n\ntl;dr Game is good, but currently I cannot recommend it due to constant bugs and crashes  hampering the experience, among other minor nuisances that add up to tedium across the experience. \n\nEven barring all that, as much as I love R-Type, this has less content than R-Type Final on the PS2 and costs $40 plus a $20 season pass for more levels, all while having far less ships than its predecessor. The graphics are phenomenal, but the content is a bit lacking right now, I hope to see more in the future that will change this to a recommended, because more content is still being added, both paid and free. Biggest things that need to be fixed are menu errors, input issues, and the crashes. \n\ntl;dr, again:\nIf you love R-Type, get it\nIf you just like schmups, wait for a sale.", "timestamp_created": 1619982671, "timestamp_updated": 1619982671, "voted_up": false, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.522613048553466797", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "91307989": {"recommendationid": "91307989", "author": {"steamid": "76561198034120792", "num_games_owned": 1262, "num_reviews": 36, "playtime_forever": 14, "playtime_last_two_weeks": 14, "playtime_at_review": 14, "last_played": 1619978896}, "language": "english", "review": "I love me some R-Type and this game seriously nails it. After believing R-Type Final on the PS2 really would be the final R-Type, and then hearing about Irem going under, I didn't think I'd ever see this game. I wasn't holding out hope. This game was a day 1 purchase for me and I don't regret it in the slightest. \n\nThe intro sequence gave me those excited goosebumps I only get on the best of occasions. The soundtrack has me hooked and I've barely scratched the surface of this game. I can't wait to dig in further. But based on what I've seen so far, I would recommend this game to fans of the series in a heartbeat. Is it perfect? I dunno, probably not. I'll admit I'm being a total fanboy over here. But I sincerely think the team behind this game have done an excellent job and have stayed faithful to series. This feels exactly like the kind of R-Type game I would want here and now.", "timestamp_created": 1619979619, "timestamp_updated": 1619979619, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.528985500335693359", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91296970": {"recommendationid": "91296970", "author": {"steamid": "76561198878414648", "num_games_owned": 389, "num_reviews": 19, "playtime_forever": 26, "playtime_last_two_weeks": 26, "playtime_at_review": 26, "last_played": 1619966923}, "language": "english", "review": "I'm sorry, i saw this and thought WOW amazing, an updated and upgraded R-Type that still looks like R-Type. One of my favourite games from my youth. \n£35 WOW that's expensive, still this is one of favourite games back in the day, i got to get it. \nMASSIVE MASSIVE disappointment. This is not an upgrade, yes the graphics are better but not brilliant no customisation options obviously just a direct port from the console, the sound is AWFUL what where they thinking the shooting sounds are the worst i've ever herd and the sound track is horrible and doesn't suit the action at all. The boss fights are suppose to be the WOW at the end and its just no tension and crap. Cheap kills to make the game seem longer and without the upgraded guns may as well give up. Really really bad wouldn't pay £5 for it. SO DISAPPOINTED.", "timestamp_created": 1619967702, "timestamp_updated": 1619967702, "voted_up": false, "votes_up": 4, "votes_funny": 2, "weighted_vote_score": "0.445265591144561768", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91290741": {"recommendationid": "91290741", "author": {"steamid": "76561198256869931", "num_games_owned": 65, "num_reviews": 8, "playtime_forever": 350, "playtime_last_two_weeks": 350, "playtime_at_review": 350, "last_played": 1619959863}, "language": "english", "review": "I'd never knew that they create a sequel to one of my favorite video game franchise. I was a big fan of r-type since the R-type Delta. I've spent too many hours in the RTF1 just to unlock all the ships available. And then comes the RTF2. The gameplay is great, challenging and quite easier to unlock ships compared to the previous one. But there are some cons, the music isn't like the RTF1 as it has the horror ambiance in a certain level. RTF2 OST however, is hyping you to shoot Bydos rather than feel the bydo horror. It's not bad, it just doesn't have the RTF1 style of soundtrack.\n\nThe graphics is okay. The fighter ship details are very good. But there are certain levels that are just too underwhelming. For example in RTF1 stage 3 where you fought the big ship, and it has a very good ship details (very much looks like a proper battleship). In RTF2, The ship design id just a bunch of plain blocks with guns equipped.\n\nI think that this game is still in early access as they are so many things lacking, But then again, i hope the devs improve the game in the upcoming versions as i like to see all of the r-type level being re-release in this game. Also, can't wait to unlock all of the ships available in the R-museum(please add a new original ships too). \n\nMy score: 7/10", "timestamp_created": 1619960859, "timestamp_updated": 1619960859, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91286857": {"recommendationid": "91286857", "author": {"steamid": "76561198092310838", "num_games_owned": 53, "num_reviews": 3, "playtime_forever": 324, "playtime_last_two_weeks": 324, "playtime_at_review": 302, "last_played": 1619968539}, "language": "english", "review": "This game is very good a bit janky here and there but i highly recommend. It's R-type, if you love difficult classic shoot em ups i hgly recommend this.\n", "timestamp_created": 1619955872, "timestamp_updated": 1619955872, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.519999980926513672", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91282709": {"recommendationid": "91282709", "author": {"steamid": "76561198387649577", "num_games_owned": 146, "num_reviews": 1, "playtime_forever": 26, "playtime_last_two_weeks": 26, "playtime_at_review": 17, "last_played": 1619951071}, "language": "english", "review": "Love Letter for Shooter and R Type Fans\n\nI've been playing lots of shooter games till now, especially R Type series. from original title (1-3) and R Type Final on PS2 back before. And since that time, I've been waiting until I find very good quality shooter games again.\n\nAnd I'm very happy my waiting comes to end when R Type Final 2 released on Steam several days ago. And when I'm only on the early stage of this game with very minimum playtime, I'm absolutely can say positive things about the game:\n\n- good graphic and style. Reminded me a lot of R Type Final graphic style, but better and smoother this time. The effect of weapon retain same vibe with R Type 3, even on the early stage you will fight giant mecha same as R Type 3. what a nostalgic scene\n\n- good pace of enemies wave. and it gets tougher on higher difficulty stage with limited space on screen to manuever your ship\n\n- Good variety and design of ships. What is a shooter without good looking and cool ships to choose? This is the reason why I played R Type since back then. And this time, it comes with good range of ships to choose. And I think they still keep the original ships, and similar unit like albatros and cerberus from previous R Type games\n\n- decent customization options for your unit. so far, Im quite satisfied to get opportunity to choose color for lots of ship parts, even add visible decal on your ship\n\nWhat I think Developer need to improve for further patch update:\n- some of menus had difficulty to navigate (either with keyboard or controller). Especially in gallery and several options menu. I find on several occasion its like stuck and kind of difficult to get back to previous menu\n\nOverall this is a really good shooter game, and dare I say its a love letter for shooter and R Type fans. So go on, do yourself a favor and try the game ASAP :)", "timestamp_created": 1619950497, "timestamp_updated": 1619950497, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91276436": {"recommendationid": "91276436", "author": {"steamid": "76561198032085561", "num_games_owned": 330, "num_reviews": 15, "playtime_forever": 644, "playtime_last_two_weeks": 644, "playtime_at_review": 641, "last_played": 1619941927}, "language": "english", "review": "Not good, but good enough.\nThe first R-Type Final had 101 ships that could be obtained through playing the game.\nThis iteration uses a bizarre in-game currency system and has entire ship development paths locked behind a password for kickstarter backers.  I think it's kind of sad that fans of the first will miss out on ships they had access to previously.\n\nAlso, the addition of an adaptive difficulty baffles me.  Why pick normal difficulty if it's going to get harder? Why pick bydo or r-typer difficulty if it's going to relent when the player hits a rough patch? \nI don't know who asked for that feature to be added, but the game doesn't seem to benefit from it in any way unless they plan on removing the difficulty selection altogether.  My opinion, not gospel.\n\nR-Type Final 2 manages to be prettier than Final 1, but I feel the level design leaves a lot to be desired.  To that end, if the player finds themselves using only 1 out of 99 available ships because the stage layout renders the others almost useless, there must be an issue with the level design.\n\nAll that said, it's not bad, nor unplayable.  I just find myself unable to recommend it to anyone but fans of the series.\nI couldn't recommend it to all fans of the shmup genre as shmups tend to come in many incarnations -this title is a sort of niche within a niche.\nI would not recommend this game to anyone who isn't a fan of R-Type.\nFans of R-Type who have not played R-Type Final will probably get a kick out it.\nTo anyone who has played R-Type Final, skip it.  There's nothing new to see here.\n", "timestamp_created": 1619941324, "timestamp_updated": 1619941324, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91275862": {"recommendationid": "91275862", "author": {"steamid": "76561198078484019", "num_games_owned": 145, "num_reviews": 32, "playtime_forever": 284, "playtime_last_two_weeks": 284, "playtime_at_review": 77, "last_played": 1620027834}, "language": "english", "review": "Yes!!! This is exactly what I want to see! Old school games with today's graphics. RType continues the great legacy of arcade shooter/puzzle action! Just like the past games, blowing up the enemies while figuring out how each stage works. The challenge is high but does offer difficulty settings for those that need it. Action is great, graphics in full 4K look amazing and the soundtrack rocks! You earn crafting parts as you play so you can craft new ships in the museum like the last game on PS 2. Absolute perfection! If you like the RType series or arcade shooters, then this is a must! RType Final 2, even more finaler than the last game!", "timestamp_created": 1619940438, "timestamp_updated": 1619940438, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91273364": {"recommendationid": "91273364", "author": {"steamid": "76561197998778582", "num_games_owned": 1012, "num_reviews": 2, "playtime_forever": 1113, "playtime_last_two_weeks": 1113, "playtime_at_review": 931, "last_played": 1619980867}, "language": "english", "review": "Excellent!", "timestamp_created": 1619936375, "timestamp_updated": 1619936375, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "91271488": {"recommendationid": "91271488", "author": {"steamid": "76561198032687218", "num_games_owned": 532, "num_reviews": 19, "playtime_forever": 404, "playtime_last_two_weeks": 404, "playtime_at_review": 404, "last_played": 1619933049}, "language": "english", "review": "If you're into any kind of scrolling shmup, this is the game for you.", "timestamp_created": 1619933199, "timestamp_updated": 1619933199, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "91269612": {"recommendationid": "91269612", "author": {"steamid": "76561198114306158", "num_games_owned": 42, "num_reviews": 12, "playtime_forever": 70, "playtime_last_two_weeks": 70, "playtime_at_review": 50, "last_played": 1620010825}, "language": "english", "review": "This game is pretty goddamn hard but please consider getting it even if you remotely have an interest in bullet hells. R-Type needs a bigger community and this is a miracle that there is still a new game out!", "timestamp_created": 1619930169, "timestamp_updated": 1619930169, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "91269546": {"recommendationid": "91269546", "author": {"steamid": "76561199132433059", "num_games_owned": 111, "num_reviews": 1, "playtime_forever": 20, "playtime_last_two_weeks": 20, "playtime_at_review": 20, "last_played": 1619929763}, "language": "english", "review": "So... few things stand out about this game.  It's fun, up until the point that I die.  Then I respawn at a checkpoint with 0 powerups and enemies that feel designed for full powerups.  Which is decidedly not fun.\n\nAlso....  If you are going to make a PC game that I can play with a mouse and keyboard AND GIVE ME CONSOLE KEY PROMPTS!  I'm going to be getting a refund.  Still don't know what command (B) is supposed to be on the PC as apparently it's not Escape.  (And no, I didn't go into options to figure it out myself).  Yes this is a pet peeve of mine.  But I dislike games that are in your face console ports with 0 effort.  I write software for a living.  I know how easy it should be (not always the same as is) to update these things.  But if I'm playing with a mouse and keyboard (which the game has 0 issues detecting) it should show the keyboard prompts like Space and whatever the hell cancel is.\n\ntldr; Game isn't in a great place right now.  Recommend checking back alter.", "timestamp_created": 1619930054, "timestamp_updated": 1619930054, "voted_up": false, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.450000017881393433", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91266181": {"recommendationid": "91266181", "author": {"steamid": "76561198092170703", "num_games_owned": 63, "num_reviews": 7, "playtime_forever": 893, "playtime_last_two_weeks": 893, "playtime_at_review": 635, "last_played": 1620013155}, "language": "english", "review": "ALRIGHT CAMPERS\n\nTHIS GAME IS PRETTY CASH MONEY\n\nIT'S ALSO FUCKING HARD\n\nIT TOOK OUR INTERNS 2 HOURS TO BEAT ONE ROUTE ON THE 2ND EASIEST DIFFICULTY\n\nTHE GAME RESPECTS THE LORE OF R-TYPE AND EVEN ADDS IN THE BIGGER SHIPS FROM TACTICS/TACTICS 2\n\nALSO IT'S FUCKING HARD\n\nI RATE 9/10, THE BATTLESHIP IN STAGE 3 LOOKS KINDA JANK AND THE 2ND DLC STAGE IS FUCKING HARD BUT DAMN THIS IS GOOD\n\nALSO WHAT IS THE STRIDER CODE I NEED MY BALMUNG", "timestamp_created": 1619924504, "timestamp_updated": 1619924504, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.468164771795272827", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91265154": {"recommendationid": "91265154", "author": {"steamid": "76561197961708472", "num_games_owned": 852, "num_reviews": 6, "playtime_forever": 96, "playtime_last_two_weeks": 96, "playtime_at_review": 46, "last_played": 1619996274}, "language": "english", "review": "they need to fire their team that does the pc port as good lord just start again menu wise unless they litraly spent 20 seconds on the port", "timestamp_created": 1619922918, "timestamp_updated": 1619923329, "voted_up": false, "votes_up": 4, "votes_funny": 1, "weighted_vote_score": "0.494650721549987793", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91254364": {"recommendationid": "91254364", "author": {"steamid": "76561197981956354", "num_games_owned": 329, "num_reviews": 37, "playtime_forever": 110, "playtime_last_two_weeks": 110, "playtime_at_review": 110, "last_played": 1619898778}, "language": "english", "review": "This game will make you pull your hair out.", "timestamp_created": 1619906378, "timestamp_updated": 1619906378, "voted_up": false, "votes_up": 5, "votes_funny": 17, "weighted_vote_score": "0.366288870573043823", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91252557": {"recommendationid": "91252557", "author": {"steamid": "76561197969558368", "num_games_owned": 177, "num_reviews": 11, "playtime_forever": 230, "playtime_last_two_weeks": 230, "playtime_at_review": 55, "last_played": 1620029132}, "language": "english", "review": "Only playing for half an hour and built a couple ships. Love this game, played the originals and it has the same feel with updated graphics. Just really enjoyable for me. lol.", "timestamp_created": 1619903868, "timestamp_updated": 1619903868, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91251000": {"recommendationid": "91251000", "author": {"steamid": "76561197985462358", "num_games_owned": 461, "num_reviews": 6, "playtime_forever": 91, "playtime_last_two_weeks": 91, "playtime_at_review": 72, "last_played": 1619991151}, "language": "english", "review": "Loving it so far, despite being a bit rubbish at these games, I like a challenge and the art direction and soundtrack are superb!", "timestamp_created": 1619901808, "timestamp_updated": 1619901808, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91250408": {"recommendationid": "91250408", "author": {"steamid": "76561198354729327", "num_games_owned": 78, "num_reviews": 1, "playtime_forever": 333, "playtime_last_two_weeks": 333, "playtime_at_review": 257, "last_played": 1619991200}, "language": "english", "review": "i'd say this is a cross between R-Type Delta and Final. The balance feels right between the two. The levels are not as long and drawn out as Final, but more short and to the point like the originals, but still has all the upgrades and ships that Final had.\n\nIt get's hard at about stage 6.0, but not to the point that it's unfair. It's more about learning the patterns, but jesus christ, that stage 6 boss...\n\nSuperb shooter, highly recommended for any shmup fan!", "timestamp_created": 1619901049, "timestamp_updated": 1619901049, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.555598318576812744", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91249765": {"recommendationid": "91249765", "author": {"steamid": "76561198067132222", "num_games_owned": 515, "num_reviews": 5, "playtime_forever": 431, "playtime_last_two_weeks": 431, "playtime_at_review": 431, "last_played": 1619898429}, "language": "english", "review": "As an original backer on Kickstarter 2 years ago, I would say the wait was worth it and It's a fantastic shmup.  Anyone familiar with the R-Type franchise knows what they're getting into for the most part here.  It's not like the Danmakus and Gradius-like shmups that require super fast reflexes, but it's more about strategy, atmosphere, and the story-telling as told through the level design.  I remember still being in high school when I pre-ordered R-Type Final 1 for PS2 from Gamestop and I was so excited to discover all the levels and unlock all the ships.  A lot of those levels back then were a little too long, so it's nice to see the levels in this sequel shortened, similar to the very original R-Types in a way.  However, I do miss the bits of quotes and story that were in Final 1 to add a little more depth and intrigue into the gameplay.\n\nThe graphics are gorgeous and everything runs smoothly on a decent machine.  Performance-wise, this is what R-Type FInal 1 should have been as I did go back to playing it last year on my PS2 and found everything so sluggish.  You basically have to emulate it on PCSX2 to get it to feel and play more like Final 2.\n\nBeing such a fan of the series, I did pre-order the high end collector's edition for PS4 from the NIS America website mainly for the awesome R9-A metal earth model.  It was nice to receive it early and try out the game a couple days before release, but I can definitively say you must get it on Steam if you have a machine capable of running it smoothly 60-144fps with no hiccups.  At least your chances of dying due slight frame rate stutters will be lessened lol.\n\nAt the backed price of $30, to get the game and all the DLC that was planned is a fantastic price.  At the price of $65ish for the complete package and digital copies of the OST and art book is still pretty good... 11 main stages and (I think) 6 planned DLC stages?  99 ships to unlock.  I mean, I bought Dariusburst Chronicles with all the DLC when it was on sale at some point, and have only played it a handful of times, finding everything to be just a little too generic.  You can always wait for a sale too, but it's definitely a must buy for anyone who's an R-Type fan or even a fan of shmups.", "timestamp_created": 1619900293, "timestamp_updated": 1619900293, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "91248049": {"recommendationid": "91248049", "author": {"steamid": "76561198115624242", "num_games_owned": 8206, "num_reviews": 13, "playtime_forever": 376, "playtime_last_two_weeks": 381, "playtime_at_review": 376, "last_played": 1619897391}, "language": "english", "review": "This plays like R-Type and feels like the R-Types of old.  It could have done with a little more polish (stage three is underwhelming, especially in the graphics department) but it has branching stages, dozens of ships to unlock and you are bound to find some to suit your play style.  Above all, it is fun.  Frustratingly so, perhaps.  It's great to play a new old-style shmup in 2021.  Image Fight III next, please.", "timestamp_created": 1619898151, "timestamp_updated": 1619898151, "voted_up": true, "votes_up": 13, "votes_funny": 0, "weighted_vote_score": "0.672519505023956299", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "91247151": {"recommendationid": "91247151", "author": {"steamid": "76561198064665965", "num_games_owned": 131, "num_reviews": 8, "playtime_forever": 776, "playtime_last_two_weeks": 776, "playtime_at_review": 365, "last_played": 1619999466}, "language": "english", "review": "(Background: I was introduced to the series with Super way back when, loved it, and played and loved Delta and Final 1; I played all 3 of those [i]again[/i] the day before Final 2's release to give myself a solid reminder of how things evolved and what Final 2 was about to be tacked onto the end of.)\n\nFor those who have forgotten, R-Type Final 1 came out for the PS2 in 2003.  Yes, 18 years ago.  However, I believe very firmly that Final 2 is a beautiful ode to that which Irem had established R-Type, in general, had evolved into by the time Final 1 had come out, in a much sleeker and more pleasing aesthetic than Final 1 offered (my God I hated Final 1's menu aesthetic and sounds, and Final 2's are great).  In essence, I'd argue Granzella did [i]not[/i] drop the ball on how it [i]feels[/i] to play an R-Type game - I think they got the overall feel correct.\n\nAs [i]for[/i] feel, not only should I mention that the ships seem to control fine, but difficulty is part of feel as well, and yeah, R-Type has historically been on the hard side; Final 2 is merely no different in that regard and thus also hits [i]that[/i] nail on the head - \"R-Type\" and \"particularly easy\" just [i]don't[/i] traditionally go in the same sentence together, so you simply [i]can't[/i] go into Final 2 expecting the game to just keel over for you.  Effort is required to beat this game.  For what it's worth, I felt that Practice difficulty here feels to me about as hard overall as Baby (the equivalent difficulty) did on Final 1.\n\nThe stage design also seems pretty spot-on for general obstacle placement and difficulty of navigation; it is good modernization of the notions of what Irem themselves previously put us through in Delta and Final 1.  I will also give HUGE praise to stage 6 of Final 2 for the wheel cycles being [i]amazing[/i] and giving you extra opportunities for entrance/exit that you might not have thought you'd have: some previous games - R-Type III being the worst offender by far - had situations where Irem was [i]VERY[/i] unfair with cycles, automatic doors, walls, or other hair-pulling stage design elements; Final 2 never throws any wholly unfair stage design stuff at you, and I see that as fantastic.\n\nI think the main takeaways here should be:\n* We should count ourselves [i]considerably[/i] lucky that after [i]18 years[/i] we even [i]have[/i] a new mainline R-Type game [i]at all[/i], regardless of who made it.\n* We should be happy that Granzella has managed to get it as right as they [i]have[/i] - I agree with their cheesy tagline that Final 2 is \"the best R-Type we can make now.\"\n* I recommend that any fan of R-Type in general play Final 2; I feel that any actually-reasonable human being familiar with the series won't be disappointed.", "timestamp_created": 1619897016, "timestamp_updated": 1619897016, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.652311325073242188", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91245627": {"recommendationid": "91245627", "author": {"steamid": "76561198048601033", "num_games_owned": 449, "num_reviews": 5, "playtime_forever": 489, "playtime_last_two_weeks": 489, "playtime_at_review": 267, "last_played": 1619990767}, "language": "english", "review": "Can't recommend getting your force stuck in the little shop of horrors enough!", "timestamp_created": 1619895200, "timestamp_updated": 1619895200, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91244806": {"recommendationid": "91244806", "author": {"steamid": "76561197968555512", "num_games_owned": 723, "num_reviews": 5, "playtime_forever": 289, "playtime_last_two_weeks": 289, "playtime_at_review": 112, "last_played": 1619972840}, "language": "english", "review": "I was a bit wary of the switch to 3D graphics and the Unreal Engine, as one of the things I loved about R-Type was the excellent bitmap graphics, but they have really made it work here. The weird bio-mechanical Bydo aesthetic is captured perfectly, the levels themselves make great use of movement and depth, and most importantly, the reflective lasers glow powerfully against the dark corridors. The modern engine also allows for super high frame rates, which is a revelation in a game as twitchy as this.", "timestamp_created": 1619894303, "timestamp_updated": 1619894303, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "91239872": {"recommendationid": "91239872", "author": {"steamid": "76561198006653128", "num_games_owned": 1816, "num_reviews": 88, "playtime_forever": 417, "playtime_last_two_weeks": 417, "playtime_at_review": 340, "last_played": 1619895451}, "language": "english", "review": "It's a lot like R-Type Final 1", "timestamp_created": 1619888666, "timestamp_updated": 1619888666, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "91234300": {"recommendationid": "91234300", "author": {"steamid": "76561198817597644", "num_games_owned": 1776, "num_reviews": 605, "playtime_forever": 209, "playtime_last_two_weeks": 209, "playtime_at_review": 209, "last_played": 1619783891}, "language": "english", "review": "[code][h1][b]Game Overview : [/b][/h1]\nR-Type has returned! The legendary side-scroller is back and better than ever with beautifully rendered 3D graphics, exhilarating shoot-'em-up gameplay, and a multitude of stages, ships, and weapons that will allow you to conduct a symphony of destruction upon your foes.\n\n[h1][b]Nyanco's Review : [/b][/h1]\n[b]Taking off again... R-TYPE FINAL 2 is now live![/b]\n\nThe R-TYPE series is one of if not the milestone in side-scrolling shooter games. The developer Granzella is licensed by Irem Software Engineering (the original developer of the R-TYPE series) and made R-TYPE FINAL 2. This game tries to go back to its roots by adhering to the pursuit of playability and exhilaration. The R-TYPE series features a weapon called the Wave Cannon that is an energetically charged cannon with strong offensive capability and Force that is remote-controlled for protecting the fighter which can be attached to the front or the rear of the fighter to fire laser beams. In other words, the gameplay requires that players make full use of the Wave Cannon and it’s force to smash formidable enemies.\n\nThis game is designed so that the players can experience the feeling of exhilaration in the destruction of their enemies meaning it is thoroughly reliant on the feeling of how enemies are destroyed. Another interesting thing about the R-TYPE series is that not only does the player's fighter evolve, but the stages do too. The game has 10 or more original R-Type Final 2 stages from the start. Moreover, new stages are planned to be added after the release of the game, according to the developer's commentary. New types of player fighters will be developed as you progress through the depth of its gameplay. One of the most enjoyable parts of the game is finding aircraft that are effective in passing the stages that are difficult or finding the type of aircraft you like. The tension and thrill of cutting your way through huge alien enemies is something that only R-Type can offer. We highly recommended R-TYPE FINAL 2!\n\n[h1][b]Side Note[/b][/h1]\n[code]Looking for nice anime games? Let's take a look with Nyanco-chan! [b]Follow Nyanco Channel! (ฅ'ω'ฅ) [/b]https://store.steampowered.com/curator/33855818[/code][/code]\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=2473295444\n", "timestamp_created": 1619882416, "timestamp_updated": 1619882416, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.509622871875762939", "comment_count": 0, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}, "91232937": {"recommendationid": "91232937", "author": {"steamid": "76561197971241515", "num_games_owned": 216, "num_reviews": 57, "playtime_forever": 29, "playtime_last_two_weeks": 29, "playtime_at_review": 29, "last_played": 1619880141}, "language": "english", "review": "Im never trusting revamps again\nOld = Incredible\nNew = Disappointing\n\nThe whole magic of R-Type is lost here! The guns feel weak and peashooter-ish, The music is dull and depressing, The characters look like pokemon, Very flung together and absolutely nowhere near worth the full price! \n\nGona go try Strania: The Stella Machina", "timestamp_created": 1619880938, "timestamp_updated": 1619880938, "voted_up": false, "votes_up": 6, "votes_funny": 2, "weighted_vote_score": "0.461299687623977661", "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91220903": {"recommendationid": "91220903", "author": {"steamid": "76561198050369245", "num_games_owned": 41, "num_reviews": 1, "playtime_forever": 504, "playtime_last_two_weeks": 504, "playtime_at_review": 300, "last_played": 1619976946}, "language": "english", "review": "After playing this game for a while, I can say without issue that it's a solid shoot'em up and a good R-Type title.\n\nIts original levels follow a more simplistic design compared to R-Type Delta and Final, and are overall more linear and, \"videogame-y\" rather than having the feel of a 3D adventure like the previous games, but they're an overall fun experience, with bosses that are in my opinion very creative and very, very fun to fight, the highlight of most levels.\nThe difficulty of the game varies a lot between the five settings, allowing for a more relaxing and easy experience for less-skilled player (such as myself), to incredibly challenging at the higher difficulties, providing an experience suitable to all players.\n\nThe weakest part of the game is without a doubt the graphics - although the game can be truly gorgeous to look at in certain moments (especially in regards to the ship and the effects of their weapons), many stages present occasional low quality textures if not models, with stage 3.0 being the most egregious example. It can (and 3.0 straight up will) look jarring, but at least for me it doesn't take away from the overall experience of the game.\n\nI haven't played long enough to explore the depth of the ship variety, but for what I've seen they did a stellar job in that regard. The various vehicles maintain the same feel as their R-Type Final counterparts, their models and particle effects are beautiful and the customization, while not flawless, allows for some very fun tinkering with the look of your vehicles.\n\nUnlocking the ships is way different than in Final, where you were required X minutes of playtime with another specific vehicle for most of them; here, you have to buy them with currency obtained by beating levels, which means you are no longer forced to fly ships you may not like for long periods of time, but you're also not rewarded for failure anymore - whereas in Final you could die over and over and over in one section while still making progress towards the unlocks, here you'll need to reach and defeat the boss to earn the currency... But on the plus side, you can progress even just by playing your favorite ship this time around.\n\nOverall for what I've played, this game is a solid 7.5/10 - despite its flaws it's a very pleasant and fun experience, and I plan to keep going to see all this game has to offer. And while more content will indeed be welcome (not that this game is lacking in that department, quite the opposite), I'd love to see some graphical tweaks in the future to make the overall aesthetic of the game become truly beautiful to look at.", "timestamp_created": 1619865411, "timestamp_updated": 1619865411, "voted_up": true, "votes_up": 7, "votes_funny": 0, "weighted_vote_score": "0.585500538349151611", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91218445": {"recommendationid": "91218445", "author": {"steamid": "76561197971613178", "num_games_owned": 776, "num_reviews": 79, "playtime_forever": 679, "playtime_last_two_weeks": 679, "playtime_at_review": 679, "last_played": 1620027692}, "language": "english", "review": "My downthumb for this game is based mostly on it's $40 price tag. It's a good game in its own rite, however it has some flaws. At first the game looks great, but as the game goes on you start to notice it kind of looks like a 2001 original XBOX game. The texture quality and polygon count takes a major dive in certain levels and its a serious shame (Look at this late game boss: https://i.imgur.com/FLYZVEq.png). On top of that the music is entirely forgettable. They did a good job of making the first few levels and especially the player ships and selection screens look really good but that's it. You have 99 ships or so to unlock but there's only about 7 levels to play (10 with DLC). No graphics quality options, buggy controller support... Sometimes even the gameplay is frustrating due to cheapshot enemy attacks and dated movement mechanics. You can use an analogue stick but its still 8 way movement with buttons that shift you through 4 speed levels.... come on now, was this made for arcades? No? Then design the game with analogue control. I realize that's not traditional for R-Type, but still, lets get with the times. I'd wait for a sale unless you've beat the previous R-Type games and really want it. Otherwise, I would say you're better off catching up on previous entries in the series for now. Theres so many great shmups on steam that you can pick up for less then $10. Go buy like 5 or 10 of those instead. In the future people may look at this game fondly, but right now it's freakin expensive for what it is.", "timestamp_created": 1619861804, "timestamp_updated": 1620028539, "voted_up": false, "votes_up": 48, "votes_funny": 2, "weighted_vote_score": "0.607026576995849609", "comment_count": 10, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91215581": {"recommendationid": "91215581", "author": {"steamid": "76561198027889506", "num_games_owned": 45, "num_reviews": 8, "playtime_forever": 806, "playtime_last_two_weeks": 806, "playtime_at_review": 360, "last_played": 1619994665}, "language": "english", "review": "In the sense that people wanted another R-Type Final, you're pretty much getting that; 2 plays much like the previous, with all its ups and downs.\n\nThe slightly touched-up functions of the old Wave Cannons you know and love are positive for the most part; Andromalius gets a particularly welcome upgrade from this, as the shockwave continues to inflict damage for a split-second to catch another minor Bydo or two as they advance. Barrier Wave goes faster and further than before, although it's still around as bad as it's always been offensively so don't lose that Balmung.\n\nDose builds up a bit faster - a lot faster in certain specific areas (the bio-goop walls you have to destroy in some regions counts each individual little block as a 'hit'). There's a little something in Stage 1 regarding how early you can build it.\n\nSpeed is reset to 2 when you die which is slightly annoying but minor.\n\nThe ship models are beautifully detailed, a real joy to look at. The weapons have this odd style to their coloration (the original Photon-Belts in particular) but it doesn't look bad, kinda grows on you after a while.\n\nThe sound... sounds about right? It sounds like R-Type Final for the most part. Not gonna win any awards there but it's the same old atmospheric elevator death muzak you remember. The effects don't seem out of place, though at the same time *because* of it we're reminded of the series' age.\n\nTwo minor points against though:\n- Couple of the stages feel particularly short, 4 in particular (boss was fun though).\n    [Edit: Stage 7.1 makes up for this: very long, and damn-near breathtaking]\n- The stages are also prone to very similar-feeling tunnel sections, so I'm hoping the resurrected previous-game stages will help there as Delta and Leo in particular were usually great in that respect.\n We'll see if Fire Cask Factory retains its infamy.\n(Edit: OKAY YEAH IT DID THAT WAS BRILLIANT)\n\nGame's not fully optimized for all systems(hopefully that's a 'yet'); I get no problems other than the system running a little hotter than the requirements would suggest, but some folks on the forums speak of slight stutter at the start of a stage (nothing compared to what the console players are apparently experiencing though).\nNot really surprising for... almost any game launch nowadays though when we think about it, but \"everybody does it\" does not make anybody doing it better.\n\nIf you didn't like the original, you're never going to like this. If you loved the original, absolutely give this one a shot.\nJust remember, it's been over fifteen years for most people; we're the ones who've changed.", "timestamp_created": 1619857689, "timestamp_updated": 1619866754, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.570261716842651367", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "91213947": {"recommendationid": "91213947", "author": {"steamid": "76561197969426053", "num_games_owned": 1032, "num_reviews": 71, "playtime_forever": 731, "playtime_last_two_weeks": 731, "playtime_at_review": 473, "last_played": 1619922917}, "language": "english", "review": " So far it's everything I loved about Rtype Final, but more and prettier. \n\nSeriously, the graphics and music are just top notch and the game's a wonder to behold. Worth it, especially for all the little touches like how your medals show up on your pilot's chest, how you can photo mode and play dress up. I can't wait to see what wild unlocks are hidden in this game.", "timestamp_created": 1619855126, "timestamp_updated": 1619855126, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91213066": {"recommendationid": "91213066", "author": {"steamid": "76561198018458729", "num_games_owned": 193, "num_reviews": 2, "playtime_forever": 51, "playtime_last_two_weeks": 51, "playtime_at_review": 18, "last_played": 1619855573}, "language": "english", "review": "Sort of disappointing because the game is slow and jerky whereas it is very important for an r-type game to have perfect control. Just add low graphics settings if it is needed.\n\nThe graphics are sort of fuzzy too so it is not easy to see the boundaries of the enemies.\n\nLastly we should be able to speed up and skip all sequences by pressing A. The death sequence is pretty bad - just freeze and fade? At least make it skippable. The intro sequences are so underwhelming with no meaningful content and slow.\n\nWorder whether the developers ever played a shoot-em up, looks like lot of eye candy and options but don't understand the frenzy and frantic pace where you want to get immediately back in the game and move in a pixlel perfect way.\n\nThe last good R-type was the PS R-type Delta for me. Not recommended before the above are fixed.\n\n", "timestamp_created": 1619853505, "timestamp_updated": 1619853505, "voted_up": false, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.488262414932250977", "comment_count": 1, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91211815": {"recommendationid": "91211815", "author": {"steamid": "76561198027579460", "num_games_owned": 48, "num_reviews": 1, "playtime_forever": 86, "playtime_last_two_weeks": 86, "playtime_at_review": 8, "last_played": 1620034407}, "language": "english", "review": "Great game except for two technical issues. It scales the display resolution up by 2x when set to desktop window (which can be overidden by the high DPI settings in the executable compatibility options) and it grabs control of the mouse cursor which makes windowed mode completely useless anyway.", "timestamp_created": 1619851467, "timestamp_updated": 1619851467, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91211746": {"recommendationid": "91211746", "author": {"steamid": "76561197990695056", "num_games_owned": 700, "num_reviews": 59, "playtime_forever": 447, "playtime_last_two_weeks": 447, "playtime_at_review": 263, "last_played": 1620012944}, "language": "english", "review": "It's gorgeous and a worthy successor to Irem's long line of shooters.   Plays solidly even on my 3-year-old, Intel I5 / midrange Geforce GTX gaming laptop.   As with most any R-Type game better know what you're getting into -- lots of getting blowed up while you learn every new pitfall that's been laid for you.  This one isn't for folks who aren't willing to fail -- and fail a LOT -- before getting good.\n\nThe one thing I would change is adding an option to the settings to let the player select their own default ship speed.   It's not a deal-breaker, just something that would be real nice to have.", "timestamp_created": 1619851361, "timestamp_updated": 1619851361, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91211524": {"recommendationid": "91211524", "author": {"steamid": "76561198093591986", "num_games_owned": 78, "num_reviews": 1, "playtime_forever": 412, "playtime_last_two_weeks": 412, "playtime_at_review": 205, "last_played": 1619933439}, "language": "english", "review": "Fun! Feels just like R-Type Final but better. I really like it. \nHD 16:9, good level design and ques from previous games. I do miss some of the music from R-Type Final but the music does seem better overall. I enjoyed playing solo and taking turns as it's even more visually pleasing to watch than before.\n\nMinor personal nit pick is some brightly lit bullets blend in too easily around bright areas making the bullets harder to notice in time than I remember especially compared to the older games. Also took some unexpected deaths from objects I thought were in the background, This could just be me getting used to that level design. \n\nOverall great game", "timestamp_created": 1619850973, "timestamp_updated": 1619850973, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91210392": {"recommendationid": "91210392", "author": {"steamid": "76561197992673878", "num_games_owned": 948, "num_reviews": 43, "playtime_forever": 438, "playtime_last_two_weeks": 438, "playtime_at_review": 356, "last_played": 1619890023}, "language": "english", "review": "It's freaking R-Type. Do i really have to say anything other than that?\n\nIt's one of the grandaddy entries in the Horizontal 2D Shooter genre next to Gradius, and it's amazing.\n\nStages are a bit short, but in a way that's welcome since there's little downtime and most stages are nonstop shooting. I'd rather have quick, satisfying levels than ones that drag on too long, something Final 1 was guilty of.\n\nSo yeah, you like classic 80s shooting games? Get this already.", "timestamp_created": 1619849060, "timestamp_updated": 1619849060, "voted_up": true, "votes_up": 2, "votes_funny": 0, "weighted_vote_score": "0.488883882761001587", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91208300": {"recommendationid": "91208300", "author": {"steamid": "76561198292488135", "num_games_owned": 252, "num_reviews": 54, "playtime_forever": 880, "playtime_last_two_weeks": 880, "playtime_at_review": 124, "last_played": 1620012674}, "language": "english", "review": "Frames drop as fast as my credits.", "timestamp_created": 1619845254, "timestamp_updated": 1619845254, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91206449": {"recommendationid": "91206449", "author": {"steamid": "76561198123871528", "num_games_owned": 119, "num_reviews": 5, "playtime_forever": 922, "playtime_last_two_weeks": 922, "playtime_at_review": 222, "last_played": 1620016093}, "language": "english", "review": "It is amazing to see R-Type return once again, and better than ever, loved it!\n\nProud to see this game becoming a reality ever since from the April 2019 teaser tbh.\n\n[h1]Recommended to try even if you're new to R-Type?[/h1]\n\n[b]Definitely yes![/b]\n\nThe game has more extended difficulties, and has been made much easier for newcomers to get in to and enjoy the game casually. For veterans, this too is also a good pace of new things to try, as in higher difficulties, the game can get really punishing for your mistakes. Starting off again from a checkpoint is never an easy thing, but with [i]dynamic difficulty[/i], it makes you possible to pick up back from a checkpoint as they optimized it slightly convenient for you to pick up where you died off, even if your power ups are naked ( you lose all power ups if yo get shot )\n\nAs someone that plays a lot of predecessor of R-Type games, Final 2 is an amazing take, felt almost like a concept combination of R-Type Delta (with their good stage designs), and R-Type Final 1 on the PS2 (good introduction to many usable fighters). So this is considered the state of the art of R-Type games, with a lot of good things to take in.\n\nThe part that made it better with this PC port? You can game more than 60fps, and this is surprisingly something I have not really witnessed in other Shoot Em Up games in my life. This is certainly pleasing to look at, as I have a working 144hz monitor, and it works wonders. Resolution in game can go up beyond 1080p if you have a very beefy PC.", "timestamp_created": 1619841918, "timestamp_updated": 1619841918, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "91206038": {"recommendationid": "91206038", "author": {"steamid": "76561197971360957", "num_games_owned": 271, "num_reviews": 8, "playtime_forever": 478, "playtime_last_two_weeks": 478, "playtime_at_review": 313, "last_played": 1619984020}, "language": "english", "review": "I have been waiting for a long time for a true sequel to Final. It's finally here, it can be ball-busting at times, but I keep firing it up for one more try.\n\nIf you're easily frustrated, this one may not be for you.", "timestamp_created": 1619841200, "timestamp_updated": 1619841200, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91205811": {"recommendationid": "91205811", "author": {"steamid": "76561198108699807", "num_games_owned": 127, "num_reviews": 37, "playtime_forever": 554, "playtime_last_two_weeks": 554, "playtime_at_review": 303, "last_played": 1620021698}, "language": "english", "review": "funny fish", "timestamp_created": 1619840801, "timestamp_updated": 1619840801, "voted_up": true, "votes_up": 1, "votes_funny": 1, "weighted_vote_score": "0.484848499298095703", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91204901": {"recommendationid": "91204901", "author": {"steamid": "76561198022328184", "num_games_owned": 560, "num_reviews": 8, "playtime_forever": 17, "playtime_last_two_weeks": 17, "playtime_at_review": 17, "last_played": 1619839029}, "language": "english", "review": "Yeah, it's R-Type!", "timestamp_created": 1619839181, "timestamp_updated": 1619839181, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91204608": {"recommendationid": "91204608", "author": {"steamid": "76561197993869948", "num_games_owned": 625, "num_reviews": 86, "playtime_forever": 243, "playtime_last_two_weeks": 243, "playtime_at_review": 110, "last_played": 1619951903}, "language": "english", "review": "-Launch Day Review-\n\nAs a kickstarter and a giant fan of R-Type and Shmups i was very eager to boot up the game and play this game. I've been waiting for years for another game that takes what previous R-Type games did but better and.....well. It's more R-Type but i think a good explanation is in order. \n\nFirst up, it feels and plays just like Delta/Final in a good way. Ship with a unforgiving hitbox, force core at the front. Speed up and down buttons to adjust movement. This is 100% a R-Type game, with plenty of ships to use and unlock. The problem is that it's trying to be the early R-Type games while also trying to be like Delta/Final, but it's drawing on too much from the former than the latter. Considering that this game was marketed like it was going to be more Delta/Final than R-Type 1/2/3 it's somewhat misleading.\n\nTwo big examples is the OST and the Level design. There's too much energy in the music for the most part and it seems to have some pacing issues (perhaps a technical issue?). It's not bad music mind you, but it feels like it would had fit a more retro-themed or hard-core game. Now the Level design....OH BOY. This...this is a doozy for me. It doesn't make good use of it's '3D space'. It feels like you're always travelling on a line. \n\n\"But R-Type games have you always travelling on a line.\"\n\nTrue for the early games but again, Delta and Final did things to compensate. Interesting Rotations of the background, moving the scenery about, water effects and it had enemies come in and out of the scene in cool ways. Final 2 meanwhile only uses it for the most part to rotate into another 'line'. It feels like a waste of the UT4 engine.\n\nIn addition, some of the checkpoints and enemy placement are completely unforgiving. There's one point on stage 4 that is literal cancer if you don't have a weapon for it prior. And if you die at that point of the stage you have to do it without access to any weapon other than your wave cannon and if your wave cannon can't deal with what are basically solid objects then you're done, restart the game because it would be faster to get back to that area instead of trying to futilely throw yourself into what is essentially several walls made of angry flesh.\n\nVisuals are also mixed bag. On one hand you can get some really nice shots here and there with sweeping views of space, planets in the background with objects in-between to create a lovely setting. On the other you have objects close up that look like melted chocolate. I think something may be broke with the LoD on them. At least the game runs silky smooth (For me at least).\n\nAll in all. I really wish there was a 'neutral' button for a review. The game is enjoyable enough with solid gameplay and tons of unlockables. You'll generally have a good time if you're a Shmup fan but it does seem to lack a bit of it's predecessors soul.", "timestamp_created": 1619838723, "timestamp_updated": 1619838723, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "91203983": {"recommendationid": "91203983", "author": {"steamid": "76561197988888795", "num_games_owned": 94, "num_reviews": 6, "playtime_forever": 389, "playtime_last_two_weeks": 389, "playtime_at_review": 223, "last_played": 1619923820}, "language": "english", "review": "If you loved Rype final or rtype in general get this, not a bullet hell", "timestamp_created": 1619837689, "timestamp_updated": 1619837689, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91203363": {"recommendationid": "91203363", "author": {"steamid": "76561198965472349", "num_games_owned": 23, "num_reviews": 1, "playtime_forever": 967, "playtime_last_two_weeks": 967, "playtime_at_review": 543, "last_played": 1620006032}, "language": "english", "review": "i can't believe it was like 17 years ago since R-type Final on PS2. Being called \"Final\" i never expected to see another R-type come to life. And yet, here it is. Was it worth this 17 years? OH ABSOLUTELY! Is it perfect? No, there is plenty of stuff that could have improved the game, like different ships (we have the very same ones in Final I), or add a new mechanic to the gameplay, or using more crazy camera angles. In the core, it is the same R-type Final with new maps and graphics.\n\nBut at the end of the day, i have played 8+ hours in the day of relase and loving every single second of it. Honestly I couldn't be happier to be playing R-type again like when i was a kid. I'm pretty sure i will sink 100+ hours in this, and i really hope that people buy and love this game like i do, because it would be nice to see another R-type game again at some point in the future. This is a 10/10 for me, worth every $.", "timestamp_created": 1619836697, "timestamp_updated": 1619836697, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91202855": {"recommendationid": "91202855", "author": {"steamid": "76561198049730245", "num_games_owned": 1009, "num_reviews": 21, "playtime_forever": 591, "playtime_last_two_weeks": 591, "playtime_at_review": 177, "last_played": 1619993757}, "language": "english", "review": "If you like R-Type ( even more so for R-Type Final), you will probably enjoy this game as well.\nNot much to say outside of that for people who enjoy R-Type.\n", "timestamp_created": 1619835878, "timestamp_updated": 1619835878, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "91201459": {"recommendationid": "91201459", "author": {"steamid": "76561198057464280", "num_games_owned": 139, "num_reviews": 5, "playtime_forever": 88, "playtime_last_two_weeks": 88, "playtime_at_review": 88, "last_played": 1619832554}, "language": "english", "review": "Thanks Granzella for getting me hyped over a grindfest with nerfed to shit ships and an awful difficulty curve.", "timestamp_created": 1619833433, "timestamp_updated": 1619833433, "voted_up": false, "votes_up": 5, "votes_funny": 8, "weighted_vote_score": "0.358194261789321899", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91198726": {"recommendationid": "91198726", "author": {"steamid": "76561198107818367", "num_games_owned": 247, "num_reviews": 49, "playtime_forever": 160, "playtime_last_two_weeks": 160, "playtime_at_review": 160, "last_played": 1619893014}, "language": "english", "review": "Equal parts \"aw yeah, I made it to the fourth level!\" and \"oh no I'm at the fourth level\"\n\nBest of luck to Granzella, though! They've really been putting in the work. : )", "timestamp_created": 1619828905, "timestamp_updated": 1619894471, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.463594198226928711", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91198518": {"recommendationid": "91198518", "author": {"steamid": "76561198000318945", "num_games_owned": 368, "num_reviews": 131, "playtime_forever": 304, "playtime_last_two_weeks": 304, "playtime_at_review": 111, "last_played": 1620025895}, "language": "english", "review": "It's fun, and I do recommend it since it's entertaining and lots of stuff to unlock.  It's just that these guys also made Blazing Star and Pulstar for the Neo Geo and those are a great deal better. . .\n\n[b]Graphics[/b] 7/10\n[b]Music[/b] 8/10\n[b]Gameplay[/b] 7/10\n[b]Replayability[/b] 9/10\n[b]Fun Factor[/b] 6/10\n\n[b]Overall: C[/b]", "timestamp_created": 1619828529, "timestamp_updated": 1619837173, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.331138730049133301", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91197805": {"recommendationid": "91197805", "author": {"steamid": "76561198017485881", "num_games_owned": 1220, "num_reviews": 90, "playtime_forever": 417, "playtime_last_two_weeks": 417, "playtime_at_review": 152, "last_played": 1619908261}, "language": "english", "review": "Just as difficult as it was 15 years ago. Probably the worst part of this is its goofy name, which is really nit picking.", "timestamp_created": 1619827329, "timestamp_updated": 1619827329, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.490445852279663086", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91197547": {"recommendationid": "91197547", "author": {"steamid": "76561197997695474", "num_games_owned": 195, "num_reviews": 11, "playtime_forever": 125, "playtime_last_two_weeks": 125, "playtime_at_review": 122, "last_played": 1619900167}, "language": "english", "review": "Simply amazing. Great controls, super fun, plus it has 5 levels of difficulty, so you can get used by playing on training mode until you feel comfortable with it.\n\nDevelopers are actually answering fast, trying to fix issues regarding some 3rd party controllers like my Retrobit Saturn 2.4ghz wireless. Although it's the first time i try to play a shmup with keyboard+mouse combination (default controls), felt it's a very precise and different way.\n\nGraphics looks very detailed and cool, sound and music has serious work on it. Game just feels great and has a different atmosphere, it's not just another game on this genre.\n\n10/10", "timestamp_created": 1619826911, "timestamp_updated": 1619826911, "voted_up": true, "votes_up": 6, "votes_funny": 0, "weighted_vote_score": "0.53892219066619873", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91196887": {"recommendationid": "91196887", "author": {"steamid": "76561198016871310", "num_games_owned": 408, "num_reviews": 31, "playtime_forever": 34, "playtime_last_two_weeks": 34, "playtime_at_review": 34, "last_played": 1619810694}, "language": "english", "review": "refunded. controller support isn't there despite what the store page says. you can barely navigate the various menus with the keyboard. I actually got stuck in one menu for over five mins because the back button wasn't working. Prices aren't super clear. for something that is just a reskin of a game from 2000 they didn't get alot right. it doesn't even have all the ships in, future levels are going to be sold as DLC, and they still haven't added multiplayer.  On top of all that, you have to sit through a hugely long video every time you boot.", "timestamp_created": 1619825788, "timestamp_updated": 1619825788, "voted_up": false, "votes_up": 6, "votes_funny": 4, "weighted_vote_score": "0.334709495306015015", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "91196451": {"recommendationid": "91196451", "author": {"steamid": "76561197998851748", "num_games_owned": 705, "num_reviews": 59, "playtime_forever": 136, "playtime_last_two_weeks": 136, "playtime_at_review": 136, "last_played": 1619824632}, "language": "english", "review": "Oh boy, I can't wait to be a war hero flying around my fighter ship into the event horizon filled with space demons that can warp reality, and am totally not using a little girl as wetware against their psychic intrusions into my cockpit.\n\nAllegedly.", "timestamp_created": 1619825043, "timestamp_updated": 1619825043, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.508816123008728027", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91195300": {"recommendationid": "91195300", "author": {"steamid": "76561197997591704", "num_games_owned": 224, "num_reviews": 8, "playtime_forever": 389, "playtime_last_two_weeks": 389, "playtime_at_review": 290, "last_played": 1619892933}, "language": "english", "review": "Hard game that makes you focus on learning enemy moves and dodging, with no forgiveness. Just like all the ones before it.\n\nIf you hit a wall and cant make any progress you can play on a lower difficulty and still unlock other ships. After you get some more ships and learn the stages bump up the difficulty.", "timestamp_created": 1619823136, "timestamp_updated": 1619823136, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91194172": {"recommendationid": "91194172", "author": {"steamid": "76561198007342067", "num_games_owned": 312, "num_reviews": 30, "playtime_forever": 1151, "playtime_last_two_weeks": 1151, "playtime_at_review": 123, "last_played": 1620016390}, "language": "english", "review": "Thumbs sideways, its a new r-type and that is exciting but........... why not some lovely pixel art instead of the unreal engine?? feels a bit shiny and too much bloom on the bullets leading to some sketchy collision detection. the speed change options for the ships is great and different ship options is nice too, the xbox controller dpad works ok but the analog stick is not usable. once you get shot the screen pause then restart feels dodgy or slow too. an option to switch between pixel art and shiny graphics would be perfect. that rule of not naming your file versions \"final\" here should apply, Final 2 sounds dodgy to begin with, either way i will update it as i get further into the game, i do love r-type games", "timestamp_created": 1619821472, "timestamp_updated": 1619821472, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": "0.431861788034439087", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91193229": {"recommendationid": "91193229", "author": {"steamid": "76561198172257445", "num_games_owned": 63, "num_reviews": 3, "playtime_forever": 303, "playtime_last_two_weeks": 303, "playtime_at_review": 240, "last_played": 1619903948}, "language": "english", "review": "So many references to R-Type Tactics. \nI would guess that a remake of Tactics is already on the schedule, since they pretty much have all the new models they need in this game. \n\n[spoiler] Also yes, F-B happens again.  [/spoiler]", "timestamp_created": 1619820017, "timestamp_updated": 1619820017, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "91193178": {"recommendationid": "91193178", "author": {"steamid": "76561198064578850", "num_games_owned": 267, "num_reviews": 19, "playtime_forever": 451, "playtime_last_two_weeks": 451, "playtime_at_review": 104, "last_played": 1619969838}, "language": "english", "review": "Granzella, you guys did it, it's perfection, no... somehow by some fluke, you exceeded perfection! Well worth the 17 year wait. I love R-Type III, R-Type LEO, R-Type Delta, R-Type Final, and now i love this game. Thanks guys! :)", "timestamp_created": 1619819941, "timestamp_updated": 1619908455, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.523809552192687988", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91192851": {"recommendationid": "91192851", "author": {"steamid": "76561198035346864", "num_games_owned": 133, "num_reviews": 15, "playtime_forever": 96, "playtime_last_two_weeks": 96, "playtime_at_review": 85, "last_played": 1619954224}, "language": "english", "review": "Even though it's more a mixture between the classic R-Type games and R-Type Delta than a successor to R-Type Final  when it comes to asthetics, I can absolutely recommend this game. I was an early backer and I am not disappointed by what has been delivered. It's R-Type with modern graphics in flawless 4K/60 or even 120 and I will have lots of fun with it.", "timestamp_created": 1619819437, "timestamp_updated": 1619819437, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.518716573715209961", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "91192031": {"recommendationid": "91192031", "author": {"steamid": "76561198037832243", "num_games_owned": 3, "num_reviews": 2, "playtime_forever": 171, "playtime_last_two_weeks": 171, "playtime_at_review": 171, "last_played": 1619817266}, "language": "english", "review": "Would I recommend this game? Yes, but.\n\nI backed the initial crowd funding campaign and paid ~£25; for that price I'd say it's pretty fair, but it seems the price on steam is currently ~£35 which is a little steep, and nearly £60 for a version of the game with some pointless DLC thrown in. \n\nI completed the game on the easiest difficulty setting in 3 hours, so there is certainly lots of replay value with all the unlockable ships, 3 higher difficulty settings and multiple routes/end stages to complete just like the original R-Type Final had. When you consider that, the current £35 price tag isn't too bad- it is a very pretty game but really that's all it offers largely, it doesn't bring anything new to the table at all besides a few new enemies and updated graphics, and a re-hash of previous stages/bosses.\n\nThis could ( should.. ) have been a HD remake of R-Type Final and it would actually be a better game I dare say as a result. I'd happily pay to get a HD remake of that game and R-Type Delta, this game is 'fun enough' but it seems to have an identity crisis, not knowing if it's a partial remake or trying to be it's own thing, and not doing a great job of either- good enough to enjoy, but certainly didn't blow my mind either.\n\nI would certainly wait until it goes on sale, or the price drops etc etc- in the mean time, go and replay the original games and remind yourself of how great they were, and still are; sprites ftw!", "timestamp_created": 1619818312, "timestamp_updated": 1619818312, "voted_up": true, "votes_up": 5, "votes_funny": 0, "weighted_vote_score": "0.530201315879821777", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "91191935": {"recommendationid": "91191935", "author": {"steamid": "76561197971453315", "num_games_owned": 1392, "num_reviews": 8, "playtime_forever": 788, "playtime_last_two_weeks": 788, "playtime_at_review": 181, "last_played": 1619968121}, "language": "english", "review": "30 credits later, finished the main stages - Excellent game, exactly what I've come to expect from R-Type, I would go on to say that this is so much better than its predecessor, R-Type Final.\n\nThere are some things that could have been improved, some textures are a bit poor and stage three looks rather... bland, I wish the capital ship you fight had more detail to it.\n\nThe pacing of the game is great, unlike it's predecessor, has very few empty sections, performance is great and I'm overall pleased with this, I will undoubtedly continue to play this for many years to come.", "timestamp_created": 1619818161, "timestamp_updated": 1619818161, "voted_up": true, "votes_up": 19, "votes_funny": 0, "weighted_vote_score": "0.700059950351715088", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "91191898": {"recommendationid": "91191898", "author": {"steamid": "76561197970342772", "num_games_owned": 240, "num_reviews": 1, "playtime_forever": 84, "playtime_last_two_weeks": 84, "playtime_at_review": 56, "last_played": 1620002701}, "language": "english", "review": "As a 42 year old Gamer i love this game. I sank so many 20p coins into R-type 1 and 2 Arcades as a Kid. Rushed to get Super R-type on SNES for £60 (Probably £120 in todays money) back in the early 90s. Same with R-type 3. Same with R-type Delta etc etc. I never thought id see another R-type in my lifetime and this was a total surprise to me, if id have known id have backed it from day one. Anyway the price is more than fair for and arcade Shoot em up, loads of ships to try out, good old classic try and beat the game and surpass that high score. Graphics are great. Good Music, Good Difficulty settings etc Very faithful to the originals. I cannot wait for the R-type Delta DLC level a long with the others. It would have been great to see it on the PS Vita but ill grab it on the Switch too. If you loved the originals youll love this. Ignore the whining younger generations, they need to learn to save up and appreciate gaming history. Well done, thanks for the nostalgia!", "timestamp_created": 1619818102, "timestamp_updated": 1619818102, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.516891896724700928", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91191532": {"recommendationid": "91191532", "author": {"steamid": "76561198026683605", "num_games_owned": 19, "num_reviews": 5, "playtime_forever": 284, "playtime_last_two_weeks": 284, "playtime_at_review": 232, "last_played": 1619989992}, "language": "english", "review": "Love it! Very annoying stages but still love it!", "timestamp_created": 1619817590, "timestamp_updated": 1619817590, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91190344": {"recommendationid": "91190344", "author": {"steamid": "76561198003679348", "num_games_owned": 357, "num_reviews": 42, "playtime_forever": 111, "playtime_last_two_weeks": 111, "playtime_at_review": 34, "last_played": 1619937075}, "language": "english", "review": "Takes me back to the 80s dropping all my 10ps into the arcades! Class act!", "timestamp_created": 1619815951, "timestamp_updated": 1619815951, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91190088": {"recommendationid": "91190088", "author": {"steamid": "76561197997384416", "num_games_owned": 64, "num_reviews": 3, "playtime_forever": 408, "playtime_last_two_weeks": 408, "playtime_at_review": 129, "last_played": 1619909647}, "language": "english", "review": "Great game, bit expensive (I bought the deluxe version) However I am a long time fan of the series so do not mind supporting the developers. The downloadable soundtrack is fantastic and in FLAC format. The artbook is basically a series of interview questions with the developer which is quite interesting with some art. I did preorder the Limited Edition Switch physical version, sadly it was delayed till June.  If you are a fan of shootem ups you will love it.", "timestamp_created": 1619815576, "timestamp_updated": 1619815576, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 2, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91190033": {"recommendationid": "91190033", "author": {"steamid": "76561197968596923", "num_games_owned": 463, "num_reviews": 39, "playtime_forever": 189, "playtime_last_two_weeks": 189, "playtime_at_review": 112, "last_played": 1619897273}, "language": "english", "review": "Yep, it's a true R-Type. Die, repeat, die, repeat, die.\nIt's the prettiest R-Type so far (and maybe even the prettiest shmup).\nGameplay wise, it's not as good as Delta but I think it's better than Final.\n\nAnd if you think the price is high, they really put a lot of details and attention to the graphics and animations. Very well worth it.", "timestamp_created": 1619815495, "timestamp_updated": 1619815495, "voted_up": true, "votes_up": 0, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91189403": {"recommendationid": "91189403", "author": {"steamid": "76561197991209263", "num_games_owned": 612, "num_reviews": 17, "playtime_forever": 37, "playtime_last_two_weeks": 37, "playtime_at_review": 37, "last_played": 1619814002}, "language": "english", "review": "Hugley disappointed in this. Loved the original RType. Loved RType Delta. Loved RType final. \nThis is all flash and no fun. A shadow of its former self. \nRefund Oclock I thinkl", "timestamp_created": 1619814651, "timestamp_updated": 1619814651, "voted_up": false, "votes_up": 11, "votes_funny": 3, "weighted_vote_score": "0.34375801682472229", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91187901": {"recommendationid": "91187901", "author": {"steamid": "76561198065287920", "num_games_owned": 426, "num_reviews": 108, "playtime_forever": 500, "playtime_last_two_weeks": 500, "playtime_at_review": 30, "last_played": 1620006180}, "language": "english", "review": "R-type hasn't changed that much over the years. If you have played the previous games, you know what you are in for. Still a bit annoying that you lose all upgrades on death, makes some stages more difficult than they should be.\nYou unlock ships with resources rather than spending time using the previous ship, a much better system.\nHas a ton of cosmetic options which I appreciate since you can look great in screenshots.", "timestamp_created": 1619812686, "timestamp_updated": 1619812686, "voted_up": true, "votes_up": 8, "votes_funny": 0, "weighted_vote_score": "0.527121901512145996", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91187681": {"recommendationid": "91187681", "author": {"steamid": "76561197995730586", "num_games_owned": 2656, "num_reviews": 3, "playtime_forever": 531, "playtime_last_two_weeks": 531, "playtime_at_review": 90, "last_played": 1619903983}, "language": "english", "review": "Rather than adding another short opinion to the list of reviews, I have attempted to document the things that might sway your purchase (for better or worse). Although this game was crowdfunded, I was not an early backer; I'm just a fan of the genre and the R-Type series.\n\nAlso, you can skip the first lengthy bullet below if this isn't your first foray into R-Type.\n\n\n[h1]GAMEPLAY[/h1]\n    • What separates the R-Type series most from other side-scrolling shmups is the inclusion of a \"Force\" -- the large orb you see hovering in front of your ship. All ships have such a Force that the player can leave attached, launch forward, leave out in space, and recall back to them at will. During the Force's return, the player can also fly ahead of the Force and back into it, effectively attaching it to your ship's rear instead. In all cases, the Force will emit its own (friendly) projectiles, invincibly block/destroy most all incoming (enemy) projectiles, and usually serve at least one other utilitarian purpose unique to your chosen ship's loadout (e.g., working as an independently flying companion when not attached to you, or projecting an even larger shield to deflect more bullets with, etc). On paper, this feature might seem novel at best, but in practice, it defines a major portion of R-Type's unique gameplay, strategies, and customization. Watching any duration of any gameplay videos of either R-Type Final or R-Type Final 2 should suffice for learning the significance and value of a ship's Force (and the player's ability to manipulate it).\n\n    • Kazuma Kujo (the game designer and producer for several R-Type releases, including R-Type Final) nailed the audio and visual presentation of R-Type Final 2, making the nostalgic portion of the experience all the more rewarding for former R-Type players. Moreover, the diversity in ship weapons (be it melee attacks, bouncing lasers, droppable bombs, sidekick projectile emitters, heat-seeking missiles, auto-aiming turrets, and everything in between) remains true to what I expected from a modern R-Type title.\n\n    • The 16:9 aspect ratio \"upgrade\" (from its predecessor's 4:3 aspect) measurably improves gameplay by allowing you to see upcoming enemies and obstacles in greater detail from further away, etc.\n\n    • Beyond your basic 8-directional shmup controls, the in-game ship mappings include a rapid-fire button (which fires your basic weapon at the maximum rate your weapon allows, negating any need/advantage of rapid button-mashing). You are also given dedicated buttons for slowing down and speeding up your ship's agility (that is, how fast your ship can navigate the screen-space and avoid incoming projectiles/obstacles, not how fast you progress horizontally through the level) for quick escapes or precise dodging on the fly.\n\n\n[h1]SETTINGS[/h1]\n    • You pick from 5 difficulty settings at the beginning of each run (Practice, Kids, Normal, Bydo, and R-Typer). These seem to simply adjust the number of enemies/projectiles on-screen at any given time (and perhaps their health).\n\n    • There are options to play at up to 360 FPS at 4K resolution.\n\n    • You can change the controller icons used to Keyboard, Xbox, PlayStation, and Switch styles.\n\n    • You are offered fully remappable controls for both keyboard and gamepads.\n\n    • While there are no colorblind-related accessibility settings, I have not had any situations arise where obscure color-coding played an important role.\n\n\n[h1]SHIPS[/h1]\n    • The interface seems to indicate room for 99 flyable ships in total, however, it is my understanding that not all 99 are currently present and unlockable. (The developers are quick to advertise their intention to add new content to the game post-launch, so take that as you will.) Regardless, each ship has its own projectiles, uniquely meaningful upgrades, powerful charge shots, interesting Force mechanics, and so on. And it is this diversity in customizable ships (and the gradual unlocking of them) that drives a big part of the game's \"fun factor\" and replayability.\n\n    • The \"R Museum\" (a giant warehouse showcasing your entire ship collection) from R-Type Final is fully-realized in 3D, complete with a ground-level first-person mode for exploring and viewing your collection, and a focused view to see all your individual ships from all angles while you read immersion-friendly descriptions of their loadouts, etc.\n\n    • You start the game with 3 ships unlocked, and all ships appear to be customizable. The customization interface offers 8 body colors, full RGB canopy selection (~16 million colors), 61 *extremely generic* decals that can be rotated and positioned anywhere on your ship's body as you see fit (with more optionally unlocked later), 12 missile options (with only 2 unlocked initially), and 12 companion \"bits\" (smaller projectile emitters that closely follow your ship, of which only 1 or 2 are unlocked initially), all provided and saved on a per-ship basis.\n\n    • Beyond the initial 3 ships unlocked from the start, new ships and modifications are unlocked through either crafting materials gathered in-game or bought via currency earned in-game (sans a few exceptions locked behind game progression accordingly).\n\n    • 4 ships are locked behind (all lowercase) passwords entered in the R Museum: [spoiler]The R-Type Discord guild discovered Ship #3, the R-9A3 LADYLOVE, password: loveandpeace. Twitter user bandana5656 discovered Ship #24, R-9B STRIDER, password: granzella.[/spoiler]\n\n\n[h1]GRIPES SO FAR[/h1]\n    • The length of the game is decent for an arcade-style shmup at the intended (or harder) difficulty, as countless lives will be lost as you learn the ins and outs of each stage. (The struggle of progression is similar to challenging \"Mario Maker\" levels, if that means anything to you.) But I suspect fans of the easier modes will find its 7 current levels unexpectedly short and unrewarding.\n\n    • As can be gleaned from the promotional videos and screenshots provided in Steam, the background during gameplay is bright, detailed, and interesting *almost* to a fault. While I do not believe it has measurably affected my performance in a level yet, I wouldn't be surprised to learn a portion of the playerbase was struggling to distinguish the foreground threats from the background art at the reflexive speed the game requires at harder (and thus \"busier\") difficulties. An easy fix would be the introduction of an option that allowed players to either dim the background significantly or toggle it off altogether.\n\n    • The game requires text-typing in a few select areas (naming your \"pilot\", inputting backer codes if you have any, etc), and attempts to leverage an in-game keyboard to accomplish this. Unfortunately, this was clearly a rushed \"feature\", as its implementation is beyond clunky and mandates you to use your mouse every time it comes up (even just to close it, which confusingly is done by clicking the \"Enter\" button on the virtual keyboard, regardless if you're trying to back out of it, return to the previous menu, or submit the text you've entered). Until this is fixed, using your mouse to click the \"Enter\" button is a simple workaround for this one-time issue.\n\n    • It's perhaps an insignificant shortcoming, but the initial 61 decals available to customize your ship with are *unreasonably* generic and wildly irrelevant to this game, its setting, and the genre as a whole. Among the most notable examples are a music note, a water drop, an exclamation point, 3 separate hearts (including one with with Cupid's arrow piercing it), a red lipstick kiss mark, and a crossed fork and knife. It genuinely feels like a barebones pack of public domain clip art symbols sourced from a handful of indie collections by various artists. Fortunately, you can unlock more pertinent decals with in-game currency as you progress.\n\n\n\n[table] [tr] [th]If this review was helpful, please say so via the button below. Thanks![/th] [/tr] [/table]", "timestamp_created": 1619812380, "timestamp_updated": 1619963947, "voted_up": true, "votes_up": 148, "votes_funny": 1, "weighted_vote_score": "0.906209826469421387", "comment_count": 7, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91187675": {"recommendationid": "91187675", "author": {"steamid": "76561197972860079", "num_games_owned": 739, "num_reviews": 85, "playtime_forever": 317, "playtime_last_two_weeks": 317, "playtime_at_review": 118, "last_played": 1620001883}, "language": "english", "review": "I believe this game had a pretty troubled development (including three separate crowdfunding campaigns), but I'm glad we got it in the end. R-Type Final 1 is one of my favorite shoot-em-ups so I'm glad to see just another R-Type in general.\n\nAll the ships are lovingly rendered, though the stages come off as a bit samey and simplistic (only played up to stage 4 as of this review). There's a lot of nice little touches. The bosses are pretty creative, and riff on other bosses in the series which is nice.\n\nFinal 2 has... differences I'm not sure about. I like that the stages are shorter and you get a ton of credits by only playing a couple hours, and I LOVE that you don't need to play ships for a certain amount of time, you just grind the three currencies to buy them. Which... is its own thing, but at least I get to choose what ship I want while I grind.\n\nOn the other hand, I feel like the game is a lot stingier when it comes to checkpoints; not in the amount, but that you'll restart and have to navigate the stage without a Force for a while. At least it means I have to get good.\n\nI don't think it's a perfect game, but I wasn't expecting it to be. I wanted another R-Type, and another Final at that, and I think this is a great fulfillment of that vision. I can't wait to see the stage variants and all the little secrets Granzella's put in.", "timestamp_created": 1619812366, "timestamp_updated": 1619812366, "voted_up": true, "votes_up": 14, "votes_funny": 0, "weighted_vote_score": "0.579721331596374512", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "91187048": {"recommendationid": "91187048", "author": {"steamid": "76561198184882939", "num_games_owned": 227, "num_reviews": 2, "playtime_forever": 1022, "playtime_last_two_weeks": 1022, "playtime_at_review": 97, "last_played": 1619991383}, "language": "english", "review": "Nearly 20 years since R-Type Final - and they haven't lost their touch. LETS GO !!!!\n\nFor those wondering about the price - this game has 99 different ships to unlock, and branching stage paths - that's a lot of replay value", "timestamp_created": 1619811706, "timestamp_updated": 1619812391, "voted_up": true, "votes_up": 4, "votes_funny": 0, "weighted_vote_score": "0.516634047031402588", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91186895": {"recommendationid": "91186895", "author": {"steamid": "76561198032282995", "num_games_owned": 470, "num_reviews": 7, "playtime_forever": 512, "playtime_last_two_weeks": 512, "playtime_at_review": 112, "last_played": 1619986042}, "language": "english", "review": "Runs smooth in 1440p 144Hz.\nGameplay feels like the old games and i love it.\nGood Job Granzella!", "timestamp_created": 1619811540, "timestamp_updated": 1619811540, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": 0, "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91186676": {"recommendationid": "91186676", "author": {"steamid": "76561198008885628", "num_games_owned": 220, "num_reviews": 1, "playtime_forever": 1403, "playtime_last_two_weeks": 1403, "playtime_at_review": 142, "last_played": 1619998369}, "language": "english", "review": "It's pretty good", "timestamp_created": 1619811295, "timestamp_updated": 1619811295, "voted_up": true, "votes_up": 3, "votes_funny": 0, "weighted_vote_score": "0.474016100168228149", "comment_count": 0, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "91186576": {"recommendationid": "91186576", "author": {"steamid": "76561198394758145", "num_games_owned": 11, "num_reviews": 2, "playtime_forever": 6, "playtime_last_two_weeks": 6, "playtime_at_review": 5, "last_played": 1619811598}, "language": "english", "review": "Unfortunately for me, the game does not work, it does not proceed when I am asked to acknowledge the saving of data.  I cannot recommend this game until it actually does something.  Very disappointing, Steam, I have never bought a new game before and now I will just wait for reviews instead of taking a risk like this.\n\n", "timestamp_created": 1619811145, "timestamp_updated": 1619811145, "voted_up": false, "votes_up": 7, "votes_funny": 3, "weighted_vote_score": "0.322664529085159302", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91186029": {"recommendationid": "91186029", "author": {"steamid": "76561197971368362", "num_games_owned": 174, "num_reviews": 15, "playtime_forever": 204, "playtime_last_two_weeks": 204, "playtime_at_review": 30, "last_played": 1620003660}, "language": "english", "review": "Yep, that's definitely R-Type.  The aesthetic, handling, and pound-your-ass memorization-based schmup tunnels of controller-throwing rage are back in 4k at 120 FPS.\n\nFor those new to this style of schmup: it's Dark Souls in space.  You're expected to fail, remember what you did wrong, and do it right on your next pass.\n\nGame's decent as is, but the devs are talking big smack about adding more and more stages and ships.  We'll see about that!", "timestamp_created": 1619810455, "timestamp_updated": 1619810455, "voted_up": true, "votes_up": 1, "votes_funny": 0, "weighted_vote_score": "0.47413790225982666", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91185647": {"recommendationid": "91185647", "author": {"steamid": "76561198132217547", "num_games_owned": 126, "num_reviews": 4, "playtime_forever": 1382, "playtime_last_two_weeks": 1382, "playtime_at_review": 52, "last_played": 1619985118}, "language": "english", "review": "finally", "timestamp_created": 1619809931, "timestamp_updated": 1619809931, "voted_up": true, "votes_up": 7, "votes_funny": 1, "weighted_vote_score": "0.468333929777145386", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91182627": {"recommendationid": "91182627", "author": {"steamid": "76561197970714409", "num_games_owned": 169, "num_reviews": 1, "playtime_forever": 823, "playtime_last_two_weeks": 823, "playtime_at_review": 15, "last_played": 1619991102}, "language": "english", "review": "A must buy for all R-Typers. Giving this game a first positive review just to support the franchise, even though I havent seen much of the content yet.", "timestamp_created": 1619805973, "timestamp_updated": 1619805973, "voted_up": true, "votes_up": 10, "votes_funny": 0, "weighted_vote_score": "0.391869306564331055", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91182340": {"recommendationid": "91182340", "author": {"steamid": "76561198127051785", "num_games_owned": 100, "num_reviews": 7, "playtime_forever": 556, "playtime_last_two_weeks": 556, "playtime_at_review": 30, "last_played": 1619919880}, "language": "english", "review": "This is the R-Type that I grew up with and loved!!!  I remember pumping quarters into the original R-Type arcade and this lives up to it and more.  Still feels like the original but really beautiful graphics.  Even customizing your ship with graphics is a nice touch.", "timestamp_created": 1619805601, "timestamp_updated": 1619805601, "voted_up": true, "votes_up": 26, "votes_funny": 0, "weighted_vote_score": "0.636560976505279541", "comment_count": 0, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91182045": {"recommendationid": "91182045", "author": {"steamid": "76561198261560092", "num_games_owned": 69, "num_reviews": 27, "playtime_forever": 1593, "playtime_last_two_weeks": 1593, "playtime_at_review": 30, "last_played": 1619976613}, "language": "english", "review": "[spoiler] As one of the backers, first thing first: HUGE BOOOOOOOOOOOOOOOOO to either one of the company here(There's three here wonder which one is it)steam version didn't tell under which time zone to unlock didn't show how precisely the time left to unlock the game. let me explain, \nback the kickstar backers of kickstar can play demo and get the game early. Turns out demo can only play on PS platform or the NINTENDO SWTICH.\nabout early access? by the time steam version got unlock and downloadable those who got either physics CD version or DMM platform or buy the normal version have already play throuh the game.\nGuess how I found out? OH COME GUYS IT'S ALREADY ON THE YOUTUBE! THE WHOLE PLAY THROUH. Don't know why they doing this stab right back to PC and the XBOX. \nEnough about blaming.\n[/spoiler]\n\nTo those of who are not the backers, don't miss this one---no brainer . I mean this is THE R-TYPE made by latest graphic those stuff, it's absolutely stunning. Ask your self when was last time you saw a sort of \"bleeding edge\" STG? like: YEEEEEEEES!!!!!!! This is it! This is how these type of the game gose at current gen!\nMy answer is: Nah... didn't saw much and most of it are those old game backing the day, worse of it with tag \"danmaku\" this type of the game the only easy part is have tones of the bullet just throw at player don't have about nice good or stunning look of the modeling details and every one of them except art design and music is deffrient every thing is same player hit box is this tiny wee little dot and faceing tones bullet if player can't handle it it will have the mechanism to erase those danmaku give player  invincible for a sec. \nAnd then the difficulty they got this, unlike thoes \"danmaku\" game hard part is the most easy part and boring part. This one to noob or for new player as the rank gose up harder to master,this is a very awesome part of this game:easy play hard to master.Plus there will be 102 ships to unlock pretty sure it's gonna spend lots of time to beat this game.\n\nAnd the down side, actually the big one it's just DLCs but game update and those who made this update are not machines they're humans so under normal circumstances beside breathing \nis free every single move need money even game update. The other one probably is they don't have the Infinity life mode back from R-TYPE Dimensions EX, fingers cross they'll add in~\n\nThat's it.Take off again!!!!!HELL YEAH!!!!!!!!!!! [strike] Ohhhhh... the thumbs down I'll let it stay for a while just to see if it can annoy one of them that i said on spoiler(even it's meanless). I'll promise to turn the thumbs up ASAP~.   [/strike]\n\nYEAAAAAAAAAAAAAH!!!!!!!!! UPPPPPPPPPPDAAAAAAAAAAAAAAAATEEEEEEEEEEEEE! thumbs up~", "timestamp_created": 1619805231, "timestamp_updated": 1619859621, "voted_up": true, "votes_up": 0, "votes_funny": 1, "weighted_vote_score": "0.46875", "comment_count": 1, "steam_purchase": false, "received_for_free": false, "written_during_early_access": false}, "91180827": {"recommendationid": "91180827", "author": {"steamid": "76561197994372073", "num_games_owned": 754, "num_reviews": 361, "playtime_forever": 547, "playtime_last_two_weeks": 547, "playtime_at_review": 7, "last_played": 1619995893}, "language": "english", "review": "This game fails the Bechdel Test. \n\nRick and Morty is the greatest cartoon ever, the CANCELLED Venture Brothers doesn't even come close. I heckin love science, so it's no surprise that Rick is my favorite character. He introduced me to the Bechdel Test, a convenient formula that measures female agency. It outlines a very simple requirement--two women with names have to talk to each other about something other than a man. \n\nI'm thankful that video games are becoming more progressive and diverse. I love games that showcase prominent girl protagonists. The upcoming Ratchet and Clank has the spunky Rivet, Resident Evil Village lets you play as a domineering 7 foot tall vampire lady, and even the recently released Returnal and Crash 4 both cater to my agenda too! It's still not enough though since all these women are shamefully, unfortunately white. There aren't even any playable black women in Overwatch, and don't get me started on representation in Smash Brothers. \n\nR-Type Final 2 is just another rung on the ladder that gamers use to marginalize and erase proud women and PoCs. All main characters need to look like an angry lesbian Twitter warrior with pronouns in their bio. \n\nVideo games were always a progressive and welcoming hobby. Gatekeeping is just a thing inc*ls do. Keep seething you chuds, I'll ensure that women get treated like people and there's nothing you can do about it.\n\nDo better.", "timestamp_created": 1619803715, "timestamp_updated": 1619803715, "voted_up": false, "votes_up": 15, "votes_funny": 53, "weighted_vote_score": "0.0579533502459526062", "comment_count": 38, "steam_purchase": true, "received_for_free": false, "written_during_early_access": false}, "91179665": {"recommendationid": "91179665", "author": {"steamid": "76561197995577440", "num_games_owned": 228, "num_reviews": 99, "playtime_forever": 113, "playtime_last_two_weeks": 113, "playtime_at_review": 113, "last_played": 1619740406}, "language": "english", "review": "Full review can be seen here\n\nhttps://youtu.be/RfH65dza5H4", "timestamp_created": 1619802248, "timestamp_updated": 1619802248, "voted_up": true, "votes_up": 11, "votes_funny": 0, "weighted_vote_score": "0.296655982732772827", "comment_count": 1, "steam_purchase": false, "received_for_free": true, "written_during_early_access": false}}, "query_summary": {"num_reviews": 83, "review_score": 8, "review_score_desc": "Very Positive", "total_positive": 70, "total_negative": 13, "total_reviews": 83}, "cursors": {"AoJwtJrvkfkCcanp2wI=": "Mon May  3 18:42:31 2021"}}
